<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent download recipe to download the latest unlicensed Microsoft Office 2016 installer package and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.jaymzdude.jss.MicrosoftOffice2016-CN-NoSelfService</string>
        <key>Input</key>
        <dict>
            <key>SITE</key>
            <string>Community Network</string>
            <key>CATEGORY</key>
            <string>Applications - Imported by AutoPKG</string>
            <key>GROUP_NAME</key>
            <string>CN - %NAME% Outdated or Not Installed</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/SmartGroupTemplate-CN-Outdated-NotInstalled.xml</string>
            <key>NAME</key>
            <string>Microsoft Office 2016</string>
            <key>OS_REQUIREMENTS</key>
            <string>10.13.x,10.12.x,10.11.x,10.10.x</string>
            <key>POLICY_CATEGORY</key>
            <string>CN - Current Application Installers</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate-CN-MSOffice2016Suite-NoSelfServe.xml</string>
            <!-- <key>ICON</key>
            <string>%RECIPE_DIR%/Microsoft Office.png</string>
            <key>DESCRIPTION</key>
            <string>Office 2016 is a software suite for word processing, spreadsheets, presentations, graphics and more.</string> -->
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.1</string>
        <key>ParentRecipe</key>
        <string>com.github.rtrouton.pkg.Office2016Suite</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <!-- <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string> -->
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
