<policy>
    <general>
        <site>
            <!-- <id>%SITE_ID%</id> -->
            <name>Community Network</name>
        </site>
        <name>CN - Install Latest %PROD_NAME%</name>
        <enabled>true</enabled>
        <!-- <trigger>USER_INITIATED</trigger> -->
        <trigger_checkin>false</trigger_checkin>
        <trigger_other>autoupdate-%PROD_NAME%</trigger_other>
        <frequency>Ongoing</frequency>
        <!-- <frequency>Once per computer</frequency> -->
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
    </general>
    <scope>
        <!--Scope added by JSSImporter-->
    </scope>
    <package_configuration>
      <packages>
      <size>1</size>
      <package>
        <id>590</id>
        <name>All-Microsoft_Office_2016_VL_Serializer.pkg</name>
        <action>Install</action>
        <fut>false</fut>
        <feu>false</feu>
        <update_autorun>false</update_autorun>
      </package>
      </packages>
    </package_configuration>
    <scripts>
        <!--Scripts added by JSSImporter-->
<!-- The code below removes normal.dotm. Figured it couldn't hurt to keep it in case we need this for over the top installations. 
        <script>
        <id>319</id>
        <name>ISEM - Remove Normal.dotm from User Template and all existing profiles</name>
        <priority>Before</priority>
        <parameter4/>
        <parameter5/>
        <parameter6/>
        <parameter7/>
        <parameter8/>
        <parameter9/>
        <parameter10/>
        <parameter11/>
    </script>  -->
    </scripts>
    <self_service>
        <!--Icons added by JSSImporter-->
        <!-- <use_for_self_service>true</use_for_self_service>
        <install_button_text>Install %VERSION%</install_button_text>
        <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
        <feature_on_main_page>true</feature_on_main_page> -->
    </self_service>
    <maintenance>
        <recon>true</recon>
    </maintenance>
</policy>
