<policy>
    <general>
        <site>
            <!-- <id>%SITE_ID%</id> -->
            <name>ISEM - Test Site</name>
        </site>
        <name>ISEM - Install %PROD_NAME% %VERSION%</name>
        <enabled>true</enabled>
        <trigger>USER_INITIATED</trigger>
        <!-- <trigger_checkin>true</trigger_checkin> -->
        <frequency>Ongoing</frequency>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
    </general>
    <scope>
        <!--Scope added by JSSImporter-->
    </scope>
    <package_configuration>
        <!--Package added by JSSImporter-->
    </package_configuration>
    <scripts>
        <!--Scripts added by JSSImporter-->
    </scripts>
    <self_service>
        <!--Icons added by JSSImporter-->
        <use_for_self_service>true</use_for_self_service>
        <install_button_text>Install %VERSION%</install_button_text>
        <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
    </self_service>
    <maintenance>
        <recon>true</recon>
    </maintenance>
</policy>
