<policy>
    <general>
        <site>
            <!-- <id>%SITE_ID%</id> -->
            <name>Academics for Student Athletes</name>
        </site>
        <name>ASA - Install Latest %PROD_NAME% 2016</name>
        <enabled>true</enabled>
        <trigger>USER_INITIATED</trigger>
        <trigger_checkin>false</trigger_checkin>
        <trigger_other>autoupdate-%PROD_NAME% 2016</trigger_other>
        <frequency>Ongoing</frequency>
        <!-- <frequency>Once per computer</frequency> -->
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
    </general>
    <scope>
        <!--Scope added by JSSImporter-->
    </scope>
    <package_configuration>
        <!--Package added by JSSImporter-->
    </package_configuration>
    <scripts>
        <!--Scripts added by JSSImporter-->
    </scripts>
    <self_service>
        <!--Icons added by JSSImporter-->
        <use_for_self_service>true</use_for_self_service>
        <install_button_text>Install %VERSION%</install_button_text>
        <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
        <feature_on_main_page>true</feature_on_main_page>
    </self_service>
    <maintenance>
        <recon>true</recon>
    </maintenance>
</policy>
