<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Mozilla Firefox ESR for Mac.</string>
    <key>Identifier</key>
    <string>com.github.jaymzdude.download.FirefoxESR</string>
    <key>Input</key>
    <dict>
        <key>RELEASE</key>
        <string>latest-esr</string>
        <key>LOCALE</key>
        <string>en-US</string>
	<key>NAME</key>
        <string>FirefoxESR</string>
        <key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
        <false />            
	    

	<key>DOWNLOAD_URL</key>
        <string>https://download.mozilla.org/?product=firefox-esr-latest&amp;os=osx&amp;lang=en-US</string> 
	    
    </dict>
	
	<!-- Commenting this out because it was in another esr download recipe that didn't work - will eventually remove.
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.firefox-rc-en_US</string> -->
	
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
        <!-- <dict>
            <key>Arguments</key>
            <dict>
                <key>product_name</key>
                <string>firefox</string>
                <key>release</key>
                <string>%RELEASE%</string>
                <key>locale</key>
                <string>%LOCALE%</string>
            </dict>
                <key>Processor</key>
                <string>MozillaURLProvider</string>
        </dict> -->
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Firefox.app</string>
                <key>requirement</key>
                <string>anchor apple generic and certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "43AQ936H96"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
