<!-- This is not an active recipe. Need to figure out how to get this to pull only the web plugin from the 
     listed download site (DOWNLOAD_URL). That site has both the latest versions of the app and the plugin. -->

<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest VLC Web Plugin disk image.</string>
    <key>Identifier</key>
    <string>com.github.jaymzdude.download.VLCWebPlugin</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>VLCWebPlugin</string>
        <key>DOWNLOAD_URL</key>
        <string>http://get.videolan.org/vlc/last/macosx/</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
