<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of GIMP from gimp.org and builds a package.</string>
	<key>Identifier</key>
	<string>com.github.jaymzdude.pkg.GIMP</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>GIMP</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.hansen-m.download.gimp</string>
	<key>MinimumVersion</key>
	<string>0.5.2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/GIMP.app</string>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/%NAME%.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.autopkg.hjuutilainen-recipes.GIMP/GIMPPermissionsFixer</string>
			<key>Arguments</key>
			<dict>
				<key>gimp_app_path</key>
				<string>%pkgroot%/Applications/%NAME%.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgname</key>
				<string>%NAME%-%version%</string>
				<key>pkg_request</key>
				<dict>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>id</key>
					<string>%bundleid%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
