<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of OneDrive Standalone installer pkg from Microsoft. Allows you to override if you are using some internal source to download.</string>
    <key>Identifier</key>
    <string>com.github.jaymzdude.download.MSOneDrive</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OneDrive</string>
        <key>URL</key>
        <string>https://go.microsoft.com/fwlink/?linkid=823060</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg.recipes.MSOfficeUpdates/MSOffice2016URLandUpdateInfoProvider.py</string>
            <key>Arguments</key>
            <dict>
                <key>channel</key>
                <string>%CHANNEL%</string>
                <key>locale_id</key>
                <string>%LOCALE_ID%</string>
                <key>product</key>
                <string>Outlook</string>
                <key>version</key>
                <string>%VERSION%</string>
            </dict>
        </dict>        
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%URL%</string>
                <key>filename</key>
                <string>%NAME%-%VERSION%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
